from django.http import JsonResponse

# 这里的函数名称开头必须小写
def passInfo5(request):
    # 定义需要返回的数据
    data = {
        "status": "success",
        "message": "Data retrieved successfully",
       "data": {
        "小地区低经验中学历": {
            "I": 1
        },
        "小地区中经验低学历": {
            "A": 4,
            "U": 3,
            "G": 2,
            "W": 2,
            "Z": 2
        },
        "小地区中经验中学历": {
            "D": 4740,
            "A": 3508,
            "L": 3443,
            "Z": 3127,
            "G": 3014
        },
        "小地区中经验高学历": {
            "D": 456,
            "L": 366,
            "A": 358,
            "I": 337,
            "G": 324
        },
        "小地区高经验中学历": {
            "D": 733,
            "A": 502,
            "L": 488,
            "I": 484,
            "Z": 456
        },
        "小地区高经验高学历": {
            "D": 220,
            "H": 207,
            "I": 184,
            "E": 183,
            "A": 160
        },
        "中地区低经验中学历": {
            "K": 4,
            "P": 4,
            "B": 2,
            "N": 2,
            "O": 2
        },
        "中地区低经验高学历": {
            "K": 4,
            "R": 4,
            "B": 2,
            "O": 2,
            "N": 1
        },
        "中地区中经验低学历": {
            "B": 21,
            "N": 17,
            "K": 14,
            "O": 13,
            "R": 13
        },
        "中地区中经验中学历": {
            "P": 16551,
            "O": 16150,
            "R": 15924,
            "B": 15460,
            "N": 15439
        },
        "中地区中经验高学历": {
            "K": 5526,
            "B": 5042,
            "O": 4468,
            "P": 4367,
            "N": 4098
        },
        "中地区高经验中学历": {
            "P": 4217,
            "B": 3725,
            "K": 3653,
            "R": 3636,
            "N": 3453
        },
        "中地区高经验高学历": {
            "K": 5658,
            "P": 5016,
            "B": 4548,
            "R": 3592,
            "N": 3467
        },
        "大地区低经验低学历": {
            "F": 1,
            "V": 1
        },
        "大地区低经验中学历": {
            "V": 4,
            "Y": 3,
            "S": 1
        },
        "大地区低经验高学历": {
            "F": 6,
            "Y": 5,
            "S": 4,
            "V": 3
        },
        "大地区中经验低学历": {
            "Y": 32,
            "V": 31,
            "S": 23,
            "F": 19
        },
        "大地区中经验中学历": {
            "Y": 30045,
            "S": 29088,
            "V": 28246,
            "F": 27543
        },
        "大地区中经验高学历": {
            "F": 9730,
            "S": 8077,
            "Y": 7860,
            "V": 7839
        },
        "大地区高经验中学历": {
            "Y": 7220,
            "S": 6527,
            "V": 6335,
            "F": 6291
        },
        "大地区高经验高学历": {
            "F": 9306,
            "Y": 7409,
            "S": 6581,
            "V": 6276
        }
     }

    }
    # 返回json类型数据
    return JsonResponse(data)
