from django.http import JsonResponse
 
def passInfo1(request):
    data = {
            "status": "success",
            "message": "Data retrieved successfully",
            "data": {
                "小地区低经验中学历": {
                    "leftData": {
                        "label": ["平均年薪", "行业数", "公司数"],
                        "value": [3.6, 1.0, 1.0]
                    },
                    "rightData": {
                        "label": ["招聘数", "高薪招聘数", "职位数"],
                        "value": [1.0, 0.0, 1.0]
                    }
                },
                "小地区中经验低学历": {
                    "leftData": {
                        "label": ["平均年薪", "行业数", "公司数"],
                        "value": [3.1, 13.0, 19.0]
                    },
                    "rightData": {
                        "label": ["招聘数", "高薪招聘数", "职位数"],
                        "value": [19.0, 0.0, 19.0]
                    }
                },
                "小地区中经验中学历": {
                    "leftData": {
                        "label": ["平均年薪", "行业数", "公司数"],
                        "value": [6.8, 153.0, 41306.0]
                    },
                    "rightData": {
                        "label": ["招聘数", "高薪招聘数", "职位数"],
                        "value": [44747.0, 202.0, 41306.0]
                    }
                },
                "小地区中经验高学历": {
                    "leftData": {
                        "label": ["平均年薪", "行业数", "公司数"],
                        "value": [9.1, 131.0, 4277.0]
                    },
                    "rightData": {
                        "label": ["招聘数", "高薪招聘数", "职位数"],
                        "value": [4552.0, 94.0, 4277.0]
                    }
                },
                "小地区高经验中学历": {
                    "leftData": {
                        "label": ["平均年薪", "行业数", "公司数"],
                        "value": [9.9, 134.0, 6134.0]
                    },
                    "rightData": {
                        "label": ["招聘数", "高薪招聘数", "职位数"],
                        "value": [6329.0, 99.0, 6134.0]
                    }
                },
                "小地区高经验高学历": {
                    "leftData": {
                        "label": ["平均年薪", "行业数", "公司数"],
                        "value": [14.5, 120.0, 2050.0]
                    },
                    "rightData": {
                        "label": ["招聘数", "高薪招聘数", "职位数"],
                        "value": [2124.0, 172.0, 2050.0]
                    }
                },
                "中地区低经验中学历": {
                    "leftData": {
                        "label": ["平均年薪", "行业数", "公司数"],
                        "value": [3.6, 13.0, 15.0]
                    },
                    "rightData": {
                        "label": ["招聘数", "高薪招聘数", "职位数"],
                        "value": [16.0, 0.0, 15.0]
                    }
                },
                "中地区低经验高学历": {
                    "leftData": {
                        "label": ["平均年薪", "行业数", "公司数"],
                        "value": [3.7, 10.0, 12.0]
                    },
                    "rightData": {
                        "label": ["招聘数", "高薪招聘数", "职位数"],
                        "value": [13.0, 0.0, 12.0]
                    }
                },
                "中地区中经验低学历": {
                    "leftData": {
                        "label": ["平均年薪", "行业数", "公司数"],
                        "value": [3.7, 36.0, 85.0]
                    },
                    "rightData": {
                        "label": ["招聘数", "高薪招聘数", "职位数"],
                        "value": [87.0, 0.0, 85.0]
                    }
                },
                "中地区中经验中学历": {
                    "leftData": {
                        "label": ["平均年薪", "行业数", "公司数"],
                        "value": [9.3, 157.0, 74558.0]
                    },
                    "rightData": {
                        "label": ["招聘数", "高薪招聘数", "职位数"],
                        "value": [93067.0, 1133.0, 74558.0]
                    }
                },
                "中地区中经验高学历": {
                    "leftData": {
                        "label": ["平均年薪", "行业数", "公司数"],
                        "value": [14.0, 150.0, 21331.0]
                    },
                    "rightData": {
                        "label": ["招聘数", "高薪招聘数", "职位数"],
                        "value": [27262.0, 1671.0, 21331.0]
                    }
                },
                "中地区高经验中学历": {
                    "leftData": {
                        "label": ["平均年薪", "行业数", "公司数"],
                        "value": [13.8, 154.0, 19456.0]
                    },
                    "rightData": {
                        "label": ["招聘数", "高薪招聘数", "职位数"],
                        "value": [21994.0, 941.0, 19456.0]
                    }
                },
                "中地区高经验高学历": {
                    "leftData": {
                        "label": ["平均年薪", "行业数", "公司数"],
                        "value": [24.6, 151.0, 17913.0]
                    },
                    "rightData": {
                        "label": ["招聘数", "高薪招聘数", "职位数"],
                        "value": [25680.0, 6660.0, 17913.0]
                    }
                },
                "大地区低经验低学历": {
                    "leftData": {
                        "label": ["平均年薪", "行业数", "公司数"],
                        "value": [4.2, 2.0, 2.0]
                    },
                    "rightData": {
                        "label": ["招聘数", "高薪招聘数", "职位数"],
                        "value": [2.0, 0.0, 2.0]
                    }
                },
                "大地区低经验中学历": {
                    "leftData": {
                        "label": ["平均年薪", "行业数", "公司数"],
                        "value": [3.3, 7.0, 8.0]
                    },
                    "rightData": {
                        "label": ["招聘数", "高薪招聘数", "职位数"],
                        "value": [8.0, 0.0, 8.0]
                    }
                },
                "大地区低经验高学历": {
                    "leftData": {
                        "label": ["平均年薪", "行业数", "公司数"],
                        "value": [4.9, 14.0, 18.0]
                    },
                    "rightData": {
                        "label": ["招聘数", "高薪招聘数", "职位数"],
                        "value": [18.0, 0.0, 18.0]
                    }
                },
                "大地区中经验低学历": {
                    "leftData": {
                        "label": ["平均年薪", "行业数", "公司数"],
                        "value": [3.7, 47.0, 103.0]
                    },
                    "rightData": {
                        "label": ["招聘数", "高薪招聘数", "职位数"],
                        "value": [105.0, 0.0, 103.0]
                    }
                },
                "大地区中经验中学历": {
                    "leftData": {
                        "label": ["平均年薪", "行业数", "公司数"],
                        "value": [9.0, 156.0, 87718.0]
                    },
                    "rightData": {
                        "label": ["招聘数", "高薪招聘数", "职位数"],
                        "value": [114922.0, 1056.0, 87718.0]
                    }
                },
                "大地区中经验高学历": {
                    "leftData": {
                        "label": ["平均年薪", "行业数", "公司数"],
                        "value": [12.6, 150.0, 25259.0]
                    },
                    "rightData": {
                        "label": ["招聘数", "高薪招聘数", "职位数"],
                        "value": [33506.0, 1481.0, 25259.0]
                    }
                },
                "大地区高经验中学历": {
                    "leftData": {
                        "label": ["平均年薪", "行业数", "公司数"],
                        "value": [13.0, 154.0, 22762.0]
                    },
                    "rightData": {
                        "label": ["招聘数", "高薪招聘数", "职位数"],
                        "value": [26373.0, 1019.0, 22762.0]
                    }
                },
                "大地区高经验高学历": {
                    "leftData": {
                        "label": ["平均年薪", "行业数", "公司数"],
                        "value": [21.7, 153.0, 20500.0]
                    },
                    "rightData": {
                        "label": ["招聘数", "高薪招聘数", "职位数"],
                        "value": [29572.0, 5752.0, 20500.0]
                    }
                }
            }
        }


    return JsonResponse(data)

