from django.http import JsonResponse

# 这里的函数名称开头必须小写
def passInfo4(request):
    # 定义需要返回的数据
    data = {
        "status": "success",
        "message": "Data retrieved successfully",
       "data": {
        "小地区低经验中学历": {
            "冷门行业": 1
        },
        "小地区中经验低学历": {
            "冷门行业": 9,
            "普通行业": 2,
            "热门行业": 8
        },
        "小地区中经验中学历": {
            "冷门行业": 12561,
            "普通行业": 13340,
            "热门行业": 18846
        },
        "小地区中经验高学历": {
            "冷门行业": 1562,
            "普通行业": 919,
            "热门行业": 2071
        },
        "小地区高经验中学历": {
            "冷门行业": 2154,
            "普通行业": 2090,
            "热门行业": 2085
        },
        "小地区高经验高学历": {
            "冷门行业": 897,
            "普通行业": 533,
            "热门行业": 694
        },
        "中地区低经验中学历": {
            "冷门行业": 11,
            "普通行业": 2,
            "热门行业": 3
        },
        "中地区低经验高学历": {
            "冷门行业": 12,
            "热门行业": 1
        },
        "中地区中经验低学历": {
            "冷门行业": 41,
            "普通行业": 19,
            "热门行业": 27
        },
        "中地区中经验中学历": {
            "冷门行业": 32455,
            "普通行业": 26393,
            "热门行业": 34219
        },
        "中地区中经验高学历": {
            "冷门行业": 11777,
            "普通行业": 6509,
            "热门行业": 8976
        },
        "中地区高经验中学历": {
            "冷门行业": 7993,
            "普通行业": 6751,
            "热门行业": 7250
        },
        "中地区高经验高学历": {
            "冷门行业": 11431,
            "普通行业": 5808,
            "热门行业": 8441
        },
        "大地区低经验低学历": {
            "冷门行业": 1,
            "热门行业": 1
        },
        "大地区低经验中学历": {
            "冷门行业": 3,
            "普通行业": 1,
            "热门行业": 4
        },
        "大地区低经验高学历": {
            "冷门行业": 9,
            "普通行业": 4,
            "热门行业": 5
        },
        "大地区中经验低学历": {
            "冷门行业": 43,
            "普通行业": 28,
            "热门行业": 34
        },
        "大地区中经验中学历": {
            "冷门行业": 41029,
            "普通行业": 32308,
            "热门行业": 41585
        },
        "大地区中经验高学历": {
            "冷门行业": 14160,
            "普通行业": 8151,
            "热门行业": 11195
        },
        "大地区高经验中学历": {
            "冷门行业": 9346,
            "普通行业": 8050,
            "热门行业": 8977
        },
        "大地区高经验高学历": {
            "冷门行业": 12732,
            "普通行业": 6469,
            "热门行业": 10371
        }
    }

    }
    # 返回json类型数据
    return JsonResponse(data)
